/*======================================*/
/* インクルード                         */
/*======================================*/
#include    <no_float.h>                /* stdioの簡略化 最初に置く     */
#include    <stdio.h>                   /* printfなど用                 */
#include    <machine.h>                 /* 組み込み関数用               */
#include    "h8_3048.h"                 /* H8/3048F-ONEレジスタ定義     */
#include    "i2c_eeprom.h"              /* EEP-ROM追加(データ記録)      */
#include    "types_beep.h"              /* TypeS基板のブザー            */
#include 	"isCamera.h"				/* カメラ用ライブラリ			*/
#include 	"isMaker.h"					/* マーカー検出用 */
#include	"drive.h"					/* モータードライブライブラリ	*/
#include 	"sw.h"						/* スイッチライブラリ			*/
#include 	"led.h"						/* LEDライブラリ				*/
#include	"ini.h"						/* 初期設定値					*/
/************************************************************************/
/* クロスライン検出処理                                                 */
/* 戻り値 0:クロスラインなし 1:あり                                     */
/************************************************************************/
int check_crossline( void )
{


}

/************************************************************************/
/* 右ハーフライン検出処理                                               */
/* 戻り値 0:なし 1:あり                                                 */
/************************************************************************/
int check_Rmaker( void )
{
	static int t;

	if( R_maker == 1){
		t++;
		if(t > 3) return 1;
		else	  return 0;
	}else{
		t = 0;
		return 0;
	}

}

/************************************************************************/
/* 左マーカー検出処理                                               */
/* 戻り値 0:なし 1:あり                                                 */
/************************************************************************/
int check_Lmaker( void )
{

}
