/*======================================*/
/* インクルード                         */
/*======================================*/
#include <stdio.h>
#include "h8_3048.h"                  /* R8C/38A SFRの定義ファイル    */
#include <stdio.h>                 /* printf使用ライブラリ         */
#include "i2c_eeprom.h"              /* EEP-ROM追加(データ記録)      */
#include "isCamera.h"
#include "drive.h"
#include "isSensor.h"						/* スイッチライブラリ			*/


/* 現在の状態保存用 */

/************************************************************************/
/* A/D値読み込み(AN2)                                                   */
/* 引数　 なし                                                          */
/* 戻り値 A/D値 0～1023                                                 */
/************************************************************************/
int check_Maker( void )
{
    int i;

    /* A/Dコンバータの設定 */
	i = i;						/* φADの1サイクルウエイト入れる*/
	AD_CSR |= 0x20;				/* AD スタート */
	while( !(AD_CSR & 0x80) );	/* エンドフラグをチェック */
	AD_CSR &= 0x7f;				/* エンドフラグクリア */
	i = AD_DRA >> 6;			/* 代入 */
	return i;
}
/************************************************************************/
/* end of file                                                          */
/************************************************************************/
