/*======================================*/
/* インクルード                         */
/*======================================*/
#include <stdio.h>
#include "h8_3048.h"                  /* R8C/38A SFRの定義ファイル    */
#include <stdio.h>                 /* printf使用ライブラリ         */
#include "i2c_eeprom.h"              /* EEP-ROM追加(データ記録)      */
#include "isCamera.h"
#include "drive.h"
#include "led.h"						/* スイッチライブラリ			*/


/************************************************************************/
/* モータドライブ基板TypeSのLED制御                                     */
/* 引数　4個のLED制御 0:OFF 1:ON                                        */
/************************************************************************/
void led_out( unsigned char led )
{
    unsigned char data;

    led <<= 4;
    data = P1DR & 0x0f;
    P1DR = data | led;
}

/************************************************************************/
/* カメラ用ＬＥＤライト制御                                             */
/* 引数　 0～30 ただし「-」は極性で関係ない    					        */
/************************************************************************/
void LED_Right( int pwm )
{
    unsigned int    work;

    saveData[5] = pwm;                  /* ログ保存                     */

    if( pwm > 0 ) {
        PADR |= 0x80;
		if( pwm > 30 ) pwm = 30;
    } else if( pwm < 0 ) {
        PADR |= 0x80;
        pwm = -pwm;
		if( pwm > 30 ) pwm = 30;
    }
    work   = MOTOR_CYCLE / 2 - MOTOR_OFFSET - 2;
    work   = (long)work * pwm / 100;
    ITU4_BRB = MOTOR_CYCLE / 2 - 2 - work;
}

/************************************************************************/
/* カメラ用ＬＥＤライト動作（フリー）                             */
/* 引数　 FREE or BRAKE                                                 */
/************************************************************************/
void right_mode( int mode )
{
    if( mode ) {
        P3DR |= 0x80;
    } else {
        P3DR &= 0x7f;
    }
}
/************************************************************************/
/* end of file                                                          */
/************************************************************************/
