/*======================================*/
/* インクルード                         */
/*======================================*/
#include <stdio.h>
#include "h8_3048.h"                  /* R8C/38A SFRの定義ファイル    */
#include <stdio.h>                 /* printf使用ライブラリ         */
#include "i2c_eeprom.h"              /* EEP-ROM追加(データ記録)      */
#include "isCamera.h"
#include "drive.h"
#include "sw.h"						/* スイッチライブラリ			*/


/* 現在の状態保存用 */

/************************************************************************/
/* CPUボード上のディップスイッチ値読み込み                              */
/* 戻り値 スイッチ値 0～15                                              */
/************************************************************************/
unsigned char dipsw_get( void )
{
    unsigned char sw;

    sw  = ~P6DR;                        /* ディップスイッチ読み込み     */
    sw &= 0x0f;

    return  sw;
}
/************************************************************************/
/* モータドライブ基板TypeS上のディップスイッチ値読み込み                */
/* 戻り値 スイッチ値 0～15                                              */
/************************************************************************/
unsigned char dipsw_get2( void )
{
    unsigned char sw;

    sw  = ~P2DR;                        /* ドライブ基板TypeSのSW読み込み*/

    return  sw;
}

/************************************************************************/
/* モータドライブ基板TypeS上のプッシュスイッチ値読み込み                */
/* 戻り値 スイッチ値 0:OFF 1:ON                                         */
/************************************************************************/
unsigned char pushsw_get( void )
{
    unsigned char sw;

    sw = ~P8DR & 0x10;                  /* プッシュスイッチ読み込み     */
    sw = !!sw;

    return  sw;
}
/************************************************************************/
/* end of file                                                          */
/************************************************************************/
