/****************************************************************************/
/* モータドライブ基板TypeS用ブザー処理プログラム Ver1.01                    */
/*                          2007.12 ジャパンマイコンカーラリー実行委員会    */
/****************************************************************************/

/*======================================*/
/* インクルード                         */
/*======================================*/
#include    "h8_3048.h"                 /* ポートのシンボル読み込み     */
#include    "types_beep.h"              /* TypeS基板のブザー            */

/*======================================*/
/* 定数設定                             */
/*======================================*/

/*======================================*/
/* グローバル変数の宣言                 */
/*======================================*/
static  unsigned long   dBeepTimer;     /* ブザー用タイマ               */
static  unsigned int    uBeepPattern;   /* ブザーパターン               */
static  int             iBeepMode;      /* ブザーの処理状態             */

/************************************************************************/
/* モジュール名 initBeep                                                */
/* 処理概要     ブザー関連初期化                                        */
/* 引数         なし                                                    */
/* 戻り値       なし                                                    */
/************************************************************************/
void initBeepS( void )
{
    dBeepTimer      = 0;
    uBeepPattern    = 0x0000;
    iBeepMode       = 0;
}

/************************************************************************/
/* ブザー出力パターンセット                                             */
/* 引数     unsigned int パターン                                       */
/* 戻り値   なし                                                        */
/************************************************************************/
void setBeepPatternS( unsigned int data )
{
    dBeepTimer      = 0;
    uBeepPattern    = data;
    iBeepMode       = 1;
}

/************************************************************************/
/* ブザー処理                                                           */
/* この関数を1ms毎に実行してください                                    */
/* 引数     なし                                                        */
/* 戻り値   なし                                                        */
/************************************************************************/
void beepProcessS( void )
{
    if( iBeepMode == 1 ) {
        if( dBeepTimer % 50 == 0) {
            if( uBeepPattern & 0x8000 ) {
                beep_out( 1 );
            } else {
                beep_out( 0 );
            }
            uBeepPattern <<= 1;
        }
        dBeepTimer++;
        if( dBeepTimer == 50 * 17 ) {
            beep_out( 0 );
            iBeepMode = 0;
        }
    }
}

/************************************************************************/
/* end of file                                                          */
/************************************************************************/
